02_OpenFOAM_FVM/cases/Ejercicio5/planarCouette/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.0001;

boundaryField
{

    movingWall
    {
      type            fixedValue;//epsilonWallFunction;
      value           uniform 0.001;//14.855;
    }
    bottomWall
      {
      type            fixedValue;//epsilonWallFunction;
      value           uniform 0.0001;//14.855;
    }
    #includeEtc "caseDicts/setConstraintTypes"

}


// ************************************************************************* //
