02_OpenFOAM_FVM/cases/Ejercicio5/planarCouette/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    movingWall
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(2.45004 0 0)
(2.45004 0 0)
(2.45004 0 0)
(2.45004 0 0)
(2.45004 0 0)
(2.45004 0 0)
(2.45004 0 0)
(2.45004 0 0)
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    cyc_half0
    {
        type            cyclic;
    }
    cyc_half1
    {
        type            cyclic;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
